; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 2750)
	(= (fuel plane1) 941)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at plane2 city6)
	(= (capacity plane2) 12872)
	(= (fuel plane2) 4947)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 13)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 4)
	(at plane3 city5)
	(= (capacity plane3) 10115)
	(= (fuel plane3) 514)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 13)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at plane4 city5)
	(= (capacity plane4) 11842)
	(= (fuel plane4) 2161)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 15)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 7)
	(at plane5 city5)
	(= (capacity plane5) 2506)
	(= (fuel plane5) 785)
	(= (slow-burn plane5) 1)
	(= (fast-burn plane5) 2)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 8)
	(at person1 city9)
	(at person2 city3)
	(at person3 city7)
	(at person4 city3)
	(at person5 city4)
	(at person6 city4)
	(at person7 city0)
	(at person8 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 678)
	(= (distance city0 city2) 728)
	(= (distance city0 city3) 586)
	(= (distance city0 city4) 741)
	(= (distance city0 city5) 512)
	(= (distance city0 city6) 765)
	(= (distance city0 city7) 772)
	(= (distance city0 city8) 797)
	(= (distance city0 city9) 687)
	(= (distance city1 city0) 678)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 656)
	(= (distance city1 city3) 836)
	(= (distance city1 city4) 549)
	(= (distance city1 city5) 526)
	(= (distance city1 city6) 669)
	(= (distance city1 city7) 659)
	(= (distance city1 city8) 709)
	(= (distance city1 city9) 534)
	(= (distance city2 city0) 728)
	(= (distance city2 city1) 656)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 629)
	(= (distance city2 city4) 965)
	(= (distance city2 city5) 788)
	(= (distance city2 city6) 927)
	(= (distance city2 city7) 623)
	(= (distance city2 city8) 569)
	(= (distance city2 city9) 624)
	(= (distance city3 city0) 586)
	(= (distance city3 city1) 836)
	(= (distance city3 city2) 629)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 818)
	(= (distance city3 city5) 931)
	(= (distance city3 city6) 815)
	(= (distance city3 city7) 532)
	(= (distance city3 city8) 919)
	(= (distance city3 city9) 958)
	(= (distance city4 city0) 741)
	(= (distance city4 city1) 549)
	(= (distance city4 city2) 965)
	(= (distance city4 city3) 818)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 791)
	(= (distance city4 city6) 598)
	(= (distance city4 city7) 687)
	(= (distance city4 city8) 877)
	(= (distance city4 city9) 839)
	(= (distance city5 city0) 512)
	(= (distance city5 city1) 526)
	(= (distance city5 city2) 788)
	(= (distance city5 city3) 931)
	(= (distance city5 city4) 791)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 700)
	(= (distance city5 city7) 642)
	(= (distance city5 city8) 611)
	(= (distance city5 city9) 997)
	(= (distance city6 city0) 765)
	(= (distance city6 city1) 669)
	(= (distance city6 city2) 927)
	(= (distance city6 city3) 815)
	(= (distance city6 city4) 598)
	(= (distance city6 city5) 700)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 830)
	(= (distance city6 city8) 768)
	(= (distance city6 city9) 833)
	(= (distance city7 city0) 772)
	(= (distance city7 city1) 659)
	(= (distance city7 city2) 623)
	(= (distance city7 city3) 532)
	(= (distance city7 city4) 687)
	(= (distance city7 city5) 642)
	(= (distance city7 city6) 830)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 879)
	(= (distance city7 city9) 795)
	(= (distance city8 city0) 797)
	(= (distance city8 city1) 709)
	(= (distance city8 city2) 569)
	(= (distance city8 city3) 919)
	(= (distance city8 city4) 877)
	(= (distance city8 city5) 611)
	(= (distance city8 city6) 768)
	(= (distance city8 city7) 879)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 502)
	(= (distance city9 city0) 687)
	(= (distance city9 city1) 534)
	(= (distance city9 city2) 624)
	(= (distance city9 city3) 958)
	(= (distance city9 city4) 839)
	(= (distance city9 city5) 997)
	(= (distance city9 city6) 833)
	(= (distance city9 city7) 795)
	(= (distance city9 city8) 502)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at plane2 city0)
	(at plane3 city5)
	(at plane5 city0)
	(at person1 city9)
	(at person2 city9)
	(at person3 city9)
	(at person4 city2)
	(at person5 city8)
	(at person6 city7)
	(at person7 city8)
	(at person8 city8)
	))

(:metric minimize (+ (* 2 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (fly plane5 city5 city0)
   deleted: (at plane5 city5)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 0 to 512, (fuel plane5) from 785 to 273
   goals met: 4 of 12
2. (board person7 plane1 city0)
   deleted: (at person7 city0)
   added: (in person7 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 12
3. (fly plane2 city6 city0)
   deleted: (at plane2 city6)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 512 to 4337, (fuel plane2) from 4947 to 1122
   goals met: 5 of 12
4. (refuel plane4 city5)
   changed: (fuel plane4) from 2161 to 11842
   goals met: 5 of 12
5. (fly plane4 city5 city4)
   deleted: (at plane4 city5)
   added: (at plane4 city4)
   changed: (total-fuel-used) from 4337 to 7501, (fuel plane4) from 11842 to 8678
   goals met: 5 of 12
6. (fly plane4 city4 city7)
   deleted: (at plane4 city4)
   added: (at plane4 city7)
   changed: (total-fuel-used) from 7501 to 10249, (fuel plane4) from 8678 to 5930
   goals met: 5 of 12
7. (board person3 plane4 city7)
   deleted: (at person3 city7)
   added: (in person3 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 5 of 12
8. (fly plane1 city0 city8)
   deleted: (at plane1 city0)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 10249 to 11046, (fuel plane1) from 941 to 144
   goals met: 4 of 12
9. (debark person7 plane1 city8)
   deleted: (in person7 plane1)
   added: (at person7 city8)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 12
10. (refuel plane1 city8)
   changed: (fuel plane1) from 144 to 2750
   goals met: 5 of 12
11. (fly plane4 city7 city9)
   deleted: (at plane4 city7)
   added: (at plane4 city9)
   changed: (total-fuel-used) from 11046 to 14226, (fuel plane4) from 5930 to 2750
   goals met: 5 of 12
12. (debark person3 plane4 city9)
   deleted: (in person3 plane4)
   added: (at person3 city9)
   changed: (onboard plane4) from 1 to 0
   goals met: 6 of 12
13. (fly plane1 city8 city3)
   deleted: (at plane1 city8)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 14226 to 15145, (fuel plane1) from 2750 to 1831
   goals met: 6 of 12
14. (board person2 plane1 city3)
   deleted: (at person2 city3)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 6 of 12
15. (board person4 plane1 city3)
   deleted: (at person4 city3)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 6 of 12
16. (fly plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 15145 to 15963, (fuel plane1) from 1831 to 1013
   goals met: 6 of 12
17. (board person5 plane1 city4)
   deleted: (at person5 city4)
   added: (in person5 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 6 of 12
18. (board person6 plane1 city4)
   deleted: (at person6 city4)
   added: (in person6 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 6 of 12
19. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 15963 to 16928, (fuel plane1) from 1013 to 48
   goals met: 6 of 12
20. (refuel plane1 city2)
   changed: (fuel plane1) from 48 to 2750
   goals met: 6 of 12
21. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 4 to 3
   goals met: 7 of 12
22. (zoom plane1 city2 city9)
   deleted: (at plane1 city2)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 16928 to 18176, (fuel plane1) from 2750 to 1502
   goals met: 7 of 12
23. (debark person2 plane1 city9)
   deleted: (in person2 plane1)
   added: (at person2 city9)
   changed: (onboard plane1) from 3 to 2
   goals met: 8 of 12
24. (fly plane1 city9 city1)
   deleted: (at plane1 city9)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 18176 to 18710, (fuel plane1) from 1502 to 968
   goals met: 8 of 12
25. (board person8 plane1 city1)
   deleted: (at person8 city1)
   added: (in person8 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 8 of 12
26. (fly plane1 city1 city8)
   deleted: (at plane1 city1)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 18710 to 19419, (fuel plane1) from 968 to 259
   goals met: 8 of 12
27. (refuel plane1 city8)
   changed: (fuel plane1) from 259 to 2750
   goals met: 8 of 12
28. (debark person5 plane1 city8)
   deleted: (in person5 plane1)
   added: (at person5 city8)
   changed: (onboard plane1) from 3 to 2
   goals met: 9 of 12
29. (debark person8 plane1 city8)
   deleted: (in person8 plane1)
   added: (at person8 city8)
   changed: (onboard plane1) from 2 to 1
   goals met: 10 of 12
30. (fly plane1 city8 city7)
   deleted: (at plane1 city8)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 19419 to 20298, (fuel plane1) from 2750 to 1871
   goals met: 10 of 12
31. (debark person6 plane1 city7)
   deleted: (in person6 plane1)
   added: (at person6 city7)
   changed: (onboard plane1) from 1 to 0
   goals met: 11 of 12
32. (fly plane1 city7 city0)
   deleted: (at plane1 city7)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 20298 to 21070, (fuel plane1) from 1871 to 1099
   goals met: 12 of 12
